dp-load-test-read.yml
execution:
- concurrency: 3
  ramp-up: 10s
  hold-for: 20s
  scenario: checkout

scenarios:
  checkout:
    # User-Agent: 'Mozilla/5.0 TrovitBot (X11; Linux x86_64) AppleWebKit/537.36'
    think-time: gaussian(3s, 1.5s)
    data-sources:
    - param-test.csv

    requests:        
    - url: https://acpt-checkout.api.sundiogroup.com/KW/checkout
      method: POST      
      headers:        
        Accept: application/vnd.sundiogroup.v1+json
        Content-Type: application/json
      body-file: body.txt             

reporting:
  - final-stats
  - console
  - blazemeter
  # - module: passfail
  #   criteria:
  #     - avg-rt > 1500 ms for 4s, stop as failed



  # body:
      #   accommodationId: 6141216
      #   duration: 8
      #   deparatureDate: 2021-10-05          
      #   OutboundTransportId: "DUS SKG#DV0A"
      #   InboundTransportId: "SKG DUS#29O7"
      #   mealplan: AI,
      #   transportType: Flight,
      #   participantsGroups: 
      #     room: JUNK25LU
      #     participants:            
      #       - birthdate: 1991-03-20
      #       - birthdate: 1991-03-20